export const INFO = [
    {
        icon: "💬",
        keyWord: "Communication",
        subTitle: "저만의 언어로 기록하는 것을 좋아합니다.",
        content:
            "공부를 하며 알게 된 내용이나 프로젝트 회고 뿐만 아니라 어떻게 사용할 것이며 어떤 점이 좋았고 배웠던 감정을 저만의 언어로 기록하는 것을 좋아합니다. 제가 다시 볼 수 있도록 기록하기 때문입니다. 현재까지 약 50개의 글이 있고 일주일에 하나씩은 깃허브에 업로드 하고 있습니다.",
    },

    {
        icon: "👀",
        keyWord: "Interective",
        subTitle: "흥미로운 인터렉티브에 관심이 많습니다.",
        content:
            "사용자와 상호작용하고 사용자로 하여금 흥미를 이끌어내는 일에 관심이 많습니다. 지루하지 않고 사용자의 귀찮음을 덜어주는 서비스를 만들어 보고 싶습니다!",
    },

    {
        icon: "✏️",
        keyWord: "Recording",
        subTitle: "저만의 언어로 기록하는 것을 좋아합니다.",
        content:
            "공부를 하며 알게 된 내용이나 프로젝트 회고 뿐만 아니라 어떻게 사용할 것이며 어떤 점이 좋았고 배웠던 감정을 저만의 언어로 기록하는 것을 좋아합니다. 제가 다시 볼 수 있도록 기록하기 때문입니다. 현재까지 약 50개의 글이 있고 일주일에 하나씩은 깃허브에 업로드 하고 있습니다.",
    },
];

export const REASON = [
    {
        title: [
            "저에게 중요한 가치는 성취감과 저 스스로의 발전입니다. ",
            "이것이 저의 원동력이기도 합니다.",
        ],
        content: [
            "디자인을 좋아하여 부전공으로 미디어 디자인 수업을 듣기도 하며 칭찬도 받고 저에게 만족감이라는 가치를 주었지만, ",
            "코드를 구현하며 느끼는 성취감과 공부를 하며 스스로의 발전에 더욱 큰 가치를 느끼게 되었습니다. ",
            "공부하며 포기할뻔한 순간도 있었지만 이겨내고 나아갈 수 있던 이유이기도 합니다.",
        ],
    },

    {
        title: ["재미있는 것을 좋아합니다."],
        content: [
            "계속해서 만들어 나가고 사용자를 생각하고 로직에 대해 이해하며 즐거움을 느낍니다. 사용자의 상호작용에 따라 움직이는 인터렉션을 좋아하는 이유이기도 합니다. 더 나아가 개발자를 위한 사이트나 오픈 소스를 구현해보고 싶기도 합니다. ",
            "사용자에게 선한 영향력을 주고 개발자에게 인정받을 수 있는 즐기는 개발자가 되고 싶습니다.",
        ],
    },
];

export const BREAK_POINT_DESKTOP = 1024;
export const BREAK_POINT_TABLET = 768;
export const BREAK_POINT_PHONE = 500;